# 2) თქვენი სიტყვებით ახსენით რა არის ციკლი და იტერაცია

# ციკლი არის განმეორების საშუალება, იტერაცია კი განმეორება.


# 4) შექმენით დიაპაზონი 20-დან 50-მდე და შეინახეთ ცვლადში

for i in range(20, 51):
    print(i)


# 5) შექმენით დიაპაზონი 100-დან 150-მდე და შეინახეთ ცვლადში

for u in range(100, 201):
    print(u)


# 6) შექმენით 20-დან 50-მდე ლუწი რიცხვების დიაპაზონი და შეინახეთ ცვლადში

for y in range(20, 51, 2):
    print(y)

# 7) შექმენით 11-დან 31-მდე კენტი რიცხვების დიაპაზონი და შეინახეთ ცვლადში

for o in range(11, 32, 2):
    print(o)


# 8) for ციკლით 10-ჯერ დაბეჭდეთ თქვენი სახელი და გვარი

for t in range(10):
    print("VatoTsaishvili")


# 9) 10-დან 30-მდე დაბეჭდეთ ყველა რიცხვი გაყოფილი 2-ზე

for r in range(10, 31):
    print(r / 2)


# 10) 40-დან 60-მდე დაბეჭდეთ ყველა რიცხვის მესამე ხარისხი

for e in range(40, 61):
    print(e**3)


# 11) 5-ჯერ შეეკითხეთ მომხმარებელს რიცხვი და ხუთივეჯერ დაბეჭდეთ. შეასრულეთ ციკლით, პირდაპირ დაწერილი არ ითვლება

for i in range(5):
    num1 = int(input("enter number: "))
    print(num1)

#12) მომხმარებელს შეეკითხეთ სახელი და მოახდინეთ მასზე იტერაცია for ციკლით, დაბეჭდეთ სახელის თითოეული ასო.

name = input("enter your name: ")
for i in name:
    print(i)


#13) მომხმარებელს შეეკითხეთ რიცხვი და შეინახეთ num1 ცვლადში მთელი რიცხვის სახით.
# მომხმარებელს შეეკითხეთ რიცხვი და შეინახეთ num2 ცვლადში მთელი რიცხვის სახით.
# მომხმარებელს შეეკითხეთ რიცხვი და შეინახეთ num3 ცვლადში მთელი რიცხვის სახით.
# შექმენით შემდეგი დიაპაზონი: range(num1, num2, num3)
# გადაუარეთ ამ დიაპაზონს for ციკლით და დაბეჭდეთ საიტერაციო ცვლადის კვადრატები

num1 = int(input("enter number: "))
num2 = int(input("enter number: "))
num3 = int(input("enter number: "))
for num in range(num1, num2, num3):
    print(num ** 2)

#14) ციკლის გარეთ შექმენით ცვლადი სახელად sum და გაუტოლეთ 0-ს. ციკლით იტერაცია მოახდინეთ 5-დან 15-ის ჩათვლით და თითოეული საიტერაციო ცვლადი დაუმატეთ num ცვლადს. საბოლოოდ დაბეჭდეთ sum ცვლადის მნიშვნელობა

sum = 0
for i in range(5, 16):
    sum += i

print(sum)
